Tekla.Structures.ModelInternal.dotRebarSplitter_t
Struct for the RebarSplitter.

Tekla.Structures.ModelInternal.dotRebarSplitter_t.RebarStrip
The rebar strip.

Tekla.Structures.ModelInternal.dotRebarSplitter_t.RebarCranking
The rebar cranking.

Tekla.Structures.ModelInternal.dotRebarSplitter_t.SplitType
The split type.

Tekla.Structures.ModelInternal.dotRebarSplitter_t.LappingType
The lapping type.

Tekla.Structures.ModelInternal.dotRebarSplitter_t.LapLength
The lap length.

Tekla.Structures.ModelInternal.dotRebarSplitter_t.StaggerType
The stagger type.

Tekla.Structures.ModelInternal.dotRebarSplitter_t.StaggerOffset
The stagger offset.

Tekla.Structures.ModelInternal.dotRebarSplitter_t.LapSide
The lap side.

Tekla.Structures.ModelInternal.dotRebarSplitter_t.SplitOffset
The split offset.

Tekla.Structures.ModelInternal.dotRebarSplitter_t.LapOffsetDir
The lap offset direction.